# Introduction to pivot_table()

To create a spreadsheet-style pivot table as a data frame in python, we use `pandas.pivot_table()` function. 

Syntax

pandas.pivot_table(data, 
    values=None, index=None, columns=None, aggfunc='mean', fill_value=None, margins=False, dropna=True, margins_name='All', observed=False, sort=True)


#### Parameters

* data: data frame ( Defining the dataset that is to be used for the pivot table.) 

* values: column to aggregate ( Feature that is to be seen in its statistical summary.)

* index: column ( Indexes the value passed in the value argument )

* columns: column ( For aggregating values based on certain features )

* aggfunc: function or list of functions ( Aggregating functions like sum, mean, etc )

* fill_value: scalar ( Value to replace missing values in the table )

* margins: bool ( Add all row / columns ( e.g. for subtotal / grand totals ) )

* Returns: Dataframe in excel style pivot table.

In [1]:
import pandas as pd
import numpy as np

In [2]:
x = {'Company': ['Ford', 'Ford', 'VW', 'Audi', 'Audi', 'Ford'], 
     'Price': [2, 3, 1, 2, 3, 1],
     'Weight': [4, 6, 2, 2, 4, None], 
     'Length': [6, 7, 3, 6, 8, np.nan],
     'Made': ['China', 'Mexico', 'Mexico', 'Correa', 'UK', pd.NaT]
    }
df = pd.DataFrame(data = x)
df

  Company  Price  Weight  Length    Made
0    Ford      2     4.0     6.0   China
1    Ford      3     6.0     7.0  Mexico
2      VW      1     2.0     3.0  Mexico
3    Audi      2     2.0     6.0  Correa
4    Audi      3     4.0     8.0      UK
5    Ford      1     NaN     NaN     NaT

### What is the average Price of Audi cars made in China?

In [3]:
pd.pivot_table(df, 
               index='Company', 
              )

         Length  Price  Weight
Company
Audi        7.0    2.5     3.0
Ford        6.5    2.0     5.0
VW          3.0    1.0     2.0

In [4]:
pd.pivot_table(df, 
               index='Company', 
               values = 'Price'
              )

         Price
Company
Audi       2.5
Ford       2.0
VW         1.0

In [5]:
x = pd.pivot_table(df, 
               index='Company', 
               values='Price', # will do the average of each a, b, c, d
               aggfunc = 'sum',
               #aggfunc =  ['sum', 'mean', 'count'],
               margins = True
              )#.head()

In [6]:
x

         Price
Company
Audi         5
Ford         6
VW           1
All         12

In [7]:
x.index.name = None
x

      Price
Audi      5
Ford      6
VW        1
All      12

In [8]:
df.groupby(['Company', 'Made'])[['Price']].sum()

                Price
Company Made
Audi    Correa      2
        UK          3
Ford    China       2
        Mexico      3
VW      Mexico      1

In [9]:
df['Price'].mean() # margins depends on aggfunc

2.0

In [10]:
pd.pivot_table(df, 
               index='Company', 
               values=['Price','Weight'], # will do the average of each a, b, c, d
               aggfunc = 'sum',
               margins = True,
               columns = 'Made'
              )#.head()

        Price                        Weight
Made    China Correa Mexico   UK All  China Correa Mexico   UK   All
Company
Audi      NaN    2.0    NaN  3.0   5    NaN    2.0    NaN  4.0   6.0
Ford      2.0    NaN    3.0  NaN   5    4.0    NaN    6.0  NaN  10.0
VW        NaN    NaN    1.0  NaN   1    NaN    NaN    2.0  NaN   2.0
All       2.0    2.0    4.0  3.0  11    4.0    2.0    8.0  4.0  18.0

### Answer: 

0 Audi cars made in China

In [11]:
x = {'Company': ['Ford', 'Ford', 'VW', 'Audi', 'Audi', 'Ford'], 
     'Price': [2, 3, 1, 2, 3, 1],
     'Weight': [4, 6, 2, 2, 4, 3], 
     'Length': [6, 9, 3, 6, 9, 3],
     'Made': ['China', 'Mexico', 'Mexico', 'China', 'China', 'China']
    }
df = pd.DataFrame(data = x)
df

  Company  Price  Weight  Length    Made
0    Ford      2       4       6   China
1    Ford      3       6       9  Mexico
2      VW      1       2       3  Mexico
3    Audi      2       2       6   China
4    Audi      3       4       9   China
5    Ford      1       3       3   China

In [12]:
df

  Company  Price  Weight  Length    Made
0    Ford      2       4       6   China
1    Ford      3       6       9  Mexico
2      VW      1       2       3  Mexico
3    Audi      2       2       6   China
4    Audi      3       4       9   China
5    Ford      1       3       3   China

In [13]:
pd.pivot_table(df, 
               index='Company', 
               values=['Price','Weight'], # will do the average of each a, b, c, d
               aggfunc={'Price': np.mean, 'Weight': np.sum},
               margins = True,
               margins_name='|*|Grand Total|*|',
               columns = 'Made'
              )#.head()

                  Price                          Weight         \
Made              China Mexico |*|Grand Total|*|  China Mexico
Company
Audi                2.5    NaN               2.5    6.0    NaN
Ford                1.5    3.0               2.0    7.0    6.0
VW                  NaN    1.0               1.0    NaN    2.0
|*|Grand Total|*|   2.0    2.0               2.0   13.0    8.0


Made              |*|Grand Total|*|
Company
Audi                              6
Ford                             13
VW                                2
|*|Grand Total|*|                21

In [ ]:
import numpy as np
import pandas as pd
df = pd.read_csv('https://raw.githubusercontent.com/tec03/Datasets/main/datasets/census.csv')
#pd.set_option('display.max_columns',500, 'display.max_rows', 500)
df.head()

In [ ]:
x = df.columns.tolist()
x.sort()
x

In [ ]:
pd.pivot_table(df, 
               index='STNAME', 
               values='BIRTHS2010', 
               aggfunc='mean'# 'sum', 'median'
              ).head()

In [ ]:
a = pd.pivot_table(df, 
               index='STNAME', 
               values='BIRTHS2010', 
               aggfunc='median'
               #columns='COUNTY'
              )
a.head()

In [ ]:
b = pd.pivot_table(df, 
               index='STNAME', 
               values=['BIRTHS2010','BIRTHS2011'], 
               #columns='SUMLEV', # these colums will be aggfunc in 'margins'
               aggfunc = 'median',
               margins=True # doesnt work if there is no columns. only aggregate the categories of each column
              ) #margins gives the 'ALL' at the end and botom 
b.tail()

In [ ]:
df['BIRTHS2010'].describe()

In [ ]:
b = pd.pivot_table(df, 
               index='STNAME', 
               values=['BIRTHS2010','BIRTHS2011'], 
               columns='SUMLEV', # these colums will be aggfunc in 'margins'
               aggfunc = 'mean',
               margins=True # margins is NOT SUM of all columns
              )  
b.tail(2)

In [ ]:
df['BIRTHS2010'].describe()

In [ ]:
print('*'*115)

In [ ]:
df = pd.read_csv('https://github.com/tec03/Datasets/raw/main/datasets/airline_data.csv',  
                 low_memory=False
                )
df.head(3)

### In 2019, Quarter 4, how many flights in DepartureDelayGroups -2.0 ?

In [ ]:
a = df.columns.tolist()
a.sort()
a

In [ ]:
test1 = df.loc[ : , 
               ['DepDelay','DepartureDelayGroups']
              ]

In [ ]:
test2 = df['DepDelay'].min()
test3 = df['DepDelay'].max()

In [ ]:
print(test1,test2, test3)

In [ ]:
df.groupby(['DepDelay',
            'DepartureDelayGroups'
           ]).size()

In [ ]:
pd.pivot_table(df, 
               index=['Year', 'Quarter'], 
               values='DepDelay', 
               columns='DepartureDelayGroups',# these colums will be aggfunc in 'margins'
               aggfunc= 'sum',
               margins=True
              ).tail()

In [ ]:
pd.pivot_table(df, 
               index=['Year', 'Quarter'], 
               values='AirTime', 
               aggfunc='sum', 
               margins=True 
              )

In [ ]:
data_file = 'datasets/sample_pivot.csv'
data = pd.read_csv(data_file)
data.head()

In [ ]:
sales_pivot = pd.pivot_table(data, 
                             index='Region',  
                             aggfunc=['sum', 'mean','median'],
                             values='Units',
                            )
sales_pivot

In [ ]:
pd.pivot_table(data, 
               index='Region', 
               values='Units', 
               columns='Type', # these colums will be aggfunc in 'margins'
               margins = True
              )

In [ ]:
pd.pivot_table(data, 
               index='Region', 
               values='Units', 
               columns='Type', # these colums will be aggfunc in 'margins'
               fill_value=0
              )

In [ ]:
pd.pivot_table(data, 
               index='Region', 
               values='Sales', 
               columns='Type', # these colums will be aggfunc in 'margins'
               aggfunc='sum', 
               margins='sum', 
               margins_name='Total'
              )

<!--NAVIGATION-->
< [Previous](prev) 
| [Toc](https://github.com/Egade/ClassNotes) 
| [Next](nex) >